Конфигурация/InformationRegisters/НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>НастройкиРасчетаРыночнойСтавкиПоВидамАктивов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СхемаПроверкиСущественностиОтклонений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьОпределенияРыночнойСтавки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПериодичностиОпределенияРыночнойСтавки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроверкаНаРыночностьТолькоПриПервоначальномПризнании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаБанков</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыБанковДляПолученияРыночнойПроцентнойСтавки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантРасчетаСрокаДляОтбораРыночнойСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаСрокаДепозитныхВкладов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантРасчетаСрокаДляПримененияРыночнойСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаСрокаДепозитныхВкладов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидШкалы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыШкалСредневзвешенныхПроцентныхСтавковПоДепозитам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантПолученияКлючевойСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыПолученияКлючевойСтавкиЗаПериодДействияСредневзвешенойСтавкиПоДепозитам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантПолученияДатыКлючевойСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДатыСобытийПриПримененииРыночнойСтавки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантыРасчетаРыночнойСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаРыночнойСтавкиПоДепозитамНФО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентСущественностиОтклоненияОтРыночнойСтавки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПроцентнаяСтавка</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальныйСрокДоПогашенияДляПримененияРыночнойСтавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальныйСрокДоПогашенияДляПримененияРыночнойСтавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользованиеРыночнойСтавкиБезУчетаПроцентаСущественностиОтклонения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСтавкиДляПроверкиНаРыночность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПроцентныхСтавокДляРасчетаСтоимостиДепозитныхВкладов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТочностьРыночнойСтавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентСущественностиВПроцентныхПунктах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникТаблицыСоответствияРейтингов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтклонениеКредитногоСпреда</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантОтклоненияОтРыночнойСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОтклоненияОтРыночнойСтавкиПоДепозитнымВкладам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальныйСрокДоПогашенияДляПримененияЛинейногоРасчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентСущественностиОтклоненияОтСтоимостиПоЭСП</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПроцентнаяСтавка</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеПоказыватьОтрицательныеПроценты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСтавкиДляРасчетаДисконтированногоПотока</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПроцентныхСтавокДляРасчетаСтоимостиДепозитныхВкладов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТочностьЭСП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроверкаНаРыночностьПоПеречнюЦБ580П</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодНаблюдаемыхПроцентныхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СмещениеСтандартногоОтклонения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьОценки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПереоценкиАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьРасчетаКорректировкиЭСП</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПереоценкиАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РассчитыватьЛинейноНерыночныеАктивы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьНастройкиНаДатуРазмещенияАктива</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИгнорироватьИзменениеКлючевойСтавки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантРасчетаКоэффициентаВолатильности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаКоэффициентаВолатильности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСредневзвешеннойРыночнойСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСредневзвешенныхСтавок</v8:Type>
						<v8:Type>cfg:CatalogRef.БиржевыеИндексы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТочностьГраницДиапазонаРыночнойСтавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальныйСрокАктиваДляИспользованияСхемы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Субъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыРасчетаОценочнойСтоимости</v8:Type>
						<v8:Type>cfg:DocumentRef.СделкаРЕПО</v8:Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
						<v8:Type>cfg:DocumentRef.МНО</v8:Type>
						<v8:Type>cfg:CatalogRef.ДепозитныеВклады</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦельРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦелиРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидАктива</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыАктивовДляПроверкиНаРыночность</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЮрФизЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/НастройкиРасчетаРыночнойСтавкиПоВидамАктивов/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область События_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Период = ТекущаяДата();
	Параметры.Отбор.Свойство("Субъект", ЭтаФорма.Субъект);
	
	СписокДействующихНастроекПоСчетуДУ.Параметры.УстановитьЗначениеПараметра("Период", ЭтаФорма.Период);
	СписокДействующихНастроекПоСчетуДУ.Параметры.УстановитьЗначениеПараметра("Субъект", ЭтаФорма.Субъект);
	
	Если ТипЗнч(ЭтаФорма.Субъект) <> Тип("СправочникСсылка.СчетаДоверительногоУправления") Тогда
		ПолеГруппировки = СписокДействующихНастроекПоСчетуДУ.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("СчетДоверительногоУправления");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Команды_формы

&НаКлиенте
Процедура СписокДействующихНастроекПоСчетуДУВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура("Ключ", СоздатьКлючЗаписиНастройкиРасчетаРыночнойСтавкиПоВидамАктивов(ВыбраннаяСтрока));
	ОткрытьФорму("РегистрСведений.НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ФормаЗаписи", ПараметрыФормы, ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	
	ОткрытьФорму("РегистрСведений.НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ФормаЗаписи",, ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура Копировать(Команда)
	
	ПараметрыФормы	= Новый Структура;
	
	Если Элементы.СписокДействующихНастроекПоСчетуДУ.ТекущиеДанные <> Неопределено Тогда
		ПараметрыФормы.Вставить("ЗначениеКопирования", СоздатьКлючЗаписиНастройкиРасчетаРыночнойСтавкиПоВидамАктивов(Элементы.СписокДействующихНастроекПоСчетуДУ.ТекущиеДанные));
	КонецЕсли;

	ОткрытьФорму("РегистрСведений.НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ФормаЗаписи", ПараметрыФормы, ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область Служебные_процедуры_и_функции

&НаКлиенте
Функция СоздатьКлючЗаписиНастройкиРасчетаРыночнойСтавкиПоВидамАктивов(Источник)
	
	ПараметрыКлюча = Новый Структура("Период,Организация,Субъект,Субъект,Валюта,ЦельРасчета,ВидАктива,ВидКонтрагента");
	ЗаполнитьЗначенияСвойств(ПараметрыКлюча, Источник);
	
	Возврат СоздатьКлючЗаписиНастройкиРасчетаРыночнойСтавкиПоВидамАктивовНаСервере(ПараметрыКлюча);
	
КонецФункции

&НаСервереБезКонтекста
Функция СоздатьКлючЗаписиНастройкиРасчетаРыночнойСтавкиПоВидамАктивовНаСервере(ПараметрыКлюча)
	
	Возврат РегистрыСведений.НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.СоздатьКлючЗаписи(ПараметрыКлюча);
	
КонецФункции

&НаКлиенте
Процедура НаДатуПриИзменении(Элемент)
	
	СписокДействующихНастроекПоСчетуДУ.Параметры.УстановитьЗначениеПараметра("Период", ЭтаФорма.Период);
	
КонецПроцедуры

#КонецОбласти
